vues
<template>
  <div>
    <tHeader title="RenderTree" info="toyar-admin 封装随机树" />
    <div class="tyAdmin__container">
      <div >
        <div class="reel" style="--p: 5">
          <div class="reel-bg"></div>
        </div>
        <article style="height: 500px;overflow: scroll;">
          <p>
            范慎很困难地撑着上眼皮，看着指头算自己这辈子做过些什么有意义的事情，结果右手五根瘦成筷子一样的指头还没有数完，他就叹了一口气，很伤心地放弃了这个工作。病房里的药水味总是这么刺鼻，旁边那床的老爷子前两天已经去地藏王菩萨那里报道了，大概再过几天就轮到自己吧。他得了某种怪病，重症肌无力，就是特别适合言情小说男主角的那种病。据说没得医，将来嗝屁的那天什么都动不了，只有眼泪可以流下来。痛！
          </p>
          <p>
            他这辈子确实没有做过什么有意义的事情，除了扶老奶奶过马路，在公车上让座位，与街坊邻居和睦相处，帮助同学考试作弊⋯⋯，范慎是一个传统意义上的无用好男人。他的父母早就去世了，所以只留下他一个人孤单地呆在医院里，等待着自己生命终结的那一天到来。动手脚，身体似乎失去了控制。范慎很困难地撑着上眼皮，看着指头算自己这辈子做过些什么有意义的事情，结果右手五根瘦成筷子一样的指头还没有数完，他就叹了一口气，很伤心地放弃了这个工作。病房里的药水味总是这么刺鼻，旁边那床的老爷子前两天已经去地藏王菩萨那里报道了，大概再过几天就轮到自己吧。他得了某种怪病，重症肌无力，就是特别适合言情小说男主角的那种病。据说没得医，将来嗝屁的那天什么都动不了，只有眼泪可以流下来。痛！
          </p>
          <p>
            他这辈子确实没有做过什么有意义的事情，除了扶老奶奶过马路，在公车上让座位，与街坊邻居和睦相处，帮助同学考试作弊⋯⋯，范慎是一个传统意义上的无用好男人。他的父母早就去世了，所以只留下他一个人孤单地呆在医院里，等待着自己生命终结的那一天到来。动手脚，身体似乎失去了控制。范慎很困难地撑着上眼皮，看着指头算自己这辈子做过些什么有意义的事情，结果右手五根瘦成筷子一样的指头还没有数完，他就叹了一口气，很伤心地放弃了这个工作。病房里的药水味总是这么刺鼻，旁边那床的老爷子前两天已经去地藏王菩萨那里报道了，大概再过几天就轮到自己吧。他得了某种怪病，重症肌无力，就是特别适合言情小说男主角的那种病。据说没得医，将来嗝屁的那天什么都动不了，只有眼泪可以流下来。痛！
          </p>
          <p>
            他这辈子确实没有做过什么有意义的事情，除了扶老奶奶过马路，在公车上让座位，与街坊邻居和睦相处，帮助同学考试作弊⋯⋯，范慎是一个传统意义上的无用好男人。他的父母早就去世了，所以只留下他一个人孤单地呆在医院里，等待着自己生命终结的那一天到来。动手脚，身体似乎失去了控制。范慎很困难地撑着上眼皮，看着指头算自己这辈子做过些什么有意义的事情，结果右手五根瘦成筷子一样的指头还没有数完，他就叹了一口气，很伤心地放弃了这个工作。病房里的药水味总是这么刺鼻，旁边那床的老爷子前两天已经去地藏王菩萨那里报道了，大概再过几天就轮到自己吧。他得了某种怪病，重症肌无力，就是特别适合言情小说男主角的那种病。据说没得医，将来嗝屁的那天什么都动不了，只有眼泪可以流下来。痛！
          </p>
          <p>
            他这辈子确实没有做过什么有意义的事情，除了扶老奶奶过马路，在公车上让座位，与街坊邻居和睦相处，帮助同学考试作弊⋯⋯，范慎是一个传统意义上的无用好男人。他的父母早就去世了，所以只留下他一个人孤单地呆在医院里，等待着自己生命终结的那一天到来。动手脚，身体似乎失去了控制。范慎很困难地撑着上眼皮，看着指头算自己这辈子做过些什么有意义的事情，结果右手五根瘦成筷子一样的指头还没有数完，他就叹了一口气，很伤心地放弃了这个工作。病房里的药水味总是这么刺鼻，旁边那床的老爷子前两天已经去地藏王菩萨那里报道了，大概再过几天就轮到自己吧。他得了某种怪病，重症肌无力，就是特别适合言情小说男主角的那种病。据说没得医，将来嗝屁的那天什么都动不了，只有眼泪可以流下来。痛！
          </p>
          <p>
            他这辈子确实没有做过什么有意义的事情，除了扶老奶奶过马路，在公车上让座位，与街坊邻居和睦相处，帮助同学考试作弊⋯⋯，范慎是一个传统意义上的无用好男人。他的父母早就去世了，所以只留下他一个人孤单地呆在医院里，等待着自己生命终结的那一天到来。动手脚，身体似乎失去了控制。范慎很困难地撑着上眼皮，看着指头算自己这辈子做过些什么有意义的事情，结果右手五根瘦成筷子一样的指头还没有数完，他就叹了一口气，很伤心地放弃了这个工作。病房里的药水味总是这么刺鼻，旁边那床的老爷子前两天已经去地藏王菩萨那里报道了，大概再过几天就轮到自己吧。他得了某种怪病，重症肌无力，就是特别适合言情小说男主角的那种病。据说没得医，将来嗝屁的那天什么都动不了，只有眼泪可以流下来。痛！
          </p>
          <p>
            他这辈子确实没有做过什么有意义的事情，除了扶老奶奶过马路，在公车上让座位，与街坊邻居和睦相处，帮助同学考试作弊⋯⋯，范慎是一个传统意义上的无用好男人。他的父母早就去世了，所以只留下他一个人孤单地呆在医院里，等待着自己生命终结的那一天到来。动手脚，身体似乎失去了控制。范慎很困难地撑着上眼皮，看着指头算自己这辈子做过些什么有意义的事情，结果右手五根瘦成筷子一样的指头还没有数完，他就叹了一口气，很伤心地放弃了这个工作。病房里的药水味总是这么刺鼻，旁边那床的老爷子前两天已经去地藏王菩萨那里报道了，大概再过几天就轮到自己吧。他得了某种怪病，重症肌无力，就是特别适合言情小说男主角的那种病。据说没得医，将来嗝屁的那天什么都动不了，只有眼泪可以流下来。痛！
          </p>
          <p>
            他这辈子确实没有做过什么有意义的事情，除了扶老奶奶过马路，在公车上让座位，与街坊邻居和睦相处，帮助同学考试作弊⋯⋯，范慎是一个传统意义上的无用好男人。他的父母早就去世了，所以只留下他一个人孤单地呆在医院里，等待着自己生命终结的那一天到来。动手脚，身体似乎失去了控制。范慎很困难地撑着上眼皮，看着指头算自己这辈子做过些什么有意义的事情，结果右手五根瘦成筷子一样的指头还没有数完，他就叹了一口气，很伤心地放弃了这个工作。病房里的药水味总是这么刺鼻，旁边那床的老爷子前两天已经去地藏王菩萨那里报道了，大概再过几天就轮到自己吧。他得了某种怪病，重症肌无力，就是特别适合言情小说男主角的那种病。据说没得医，将来嗝屁的那天什么都动不了，只有眼泪可以流下来。痛！
          </p>
          <p>
            他这辈子确实没有做过什么有意义的事情，除了扶老奶奶过马路，在公车上让座位，与街坊邻居和睦相处，帮助同学考试作弊⋯⋯，范慎是一个传统意义上的无用好男人。他的父母早就去世了，所以只留下他一个人孤单地呆在医院里，等待着自己生命终结的那一天到来。动手脚，身体似乎失去了控制。范慎很困难地撑着上眼皮，看着指头算自己这辈子做过些什么有意义的事情，结果右手五根瘦成筷子一样的指头还没有数完，他就叹了一口气，很伤心地放弃了这个工作。病房里的药水味总是这么刺鼻，旁边那床的老爷子前两天已经去地藏王菩萨那里报道了，大概再过几天就轮到自己吧。他得了某种怪病，重症肌无力，就是特别适合言情小说男主角的那种病。据说没得医，将来嗝屁的那天什么都动不了，只有眼泪可以流下来。痛！
          </p>
          <p>
            他这辈子确实没有做过什么有意义的事情，除了扶老奶奶过马路，在公车上让座位，与街坊邻居和睦相处，帮助同学考试作弊⋯⋯，范慎是一个传统意义上的无用好男人。他的父母早就去世了，所以只留下他一个人孤单地呆在医院里，等待着自己生命终结的那一天到来。动手脚，身体似乎失去了控制。范慎很困难地撑着上眼皮，看着指头算自己这辈子做过些什么有意义的事情，结果右手五根瘦成筷子一样的指头还没有数完，他就叹了一口气，很伤心地放弃了这个工作。病房里的药水味总是这么刺鼻，旁边那床的老爷子前两天已经去地藏王菩萨那里报道了，大概再过几天就轮到自己吧。他得了某种怪病，重症肌无力，就是特别适合言情小说男主角的那种病。据说没得医，将来嗝屁的那天什么都动不了，只有眼泪可以流下来。痛！
          </p>
          <p>
            他这辈子确实没有做过什么有意义的事情，除了扶老奶奶过马路，在公车上让座位，与街坊邻居和睦相处，帮助同学考试作弊⋯⋯，范慎是一个传统意义上的无用好男人。他的父母早就去世了，所以只留下他一个人孤单地呆在医院里，等待着自己生命终结的那一天到来。动手脚，身体似乎失去了控制。范慎很困难地撑着上眼皮，看着指头算自己这辈子做过些什么有意义的事情，结果右手五根瘦成筷子一样的指头还没有数完，他就叹了一口气，很伤心地放弃了这个工作。病房里的药水味总是这么刺鼻，旁边那床的老爷子前两天已经去地藏王菩萨那里报道了，大概再过几天就轮到自己吧。他得了某种怪病，重症肌无力，就是特别适合言情小说男主角的那种病。据说没得医，将来嗝屁的那天什么都动不了，只有眼泪可以流下来。痛！
          </p>
          <p>
            他这辈子确实没有做过什么有意义的事情，除了扶老奶奶过马路，在公车上让座位，与街坊邻居和睦相处，帮助同学考试作弊⋯⋯，范慎是一个传统意义上的无用好男人。他的父母早就去世了，所以只留下他一个人孤单地呆在医院里，等待着自己生命终结的那一天到来。动手脚，身体似乎失去了控制。范慎很困难地撑着上眼皮，看着指头算自己这辈子做过些什么有意义的事情，结果右手五根瘦成筷子一样的指头还没有数完，他就叹了一口气，很伤心地放弃了这个工作。病房里的药水味总是这么刺鼻，旁边那床的老爷子前两天已经去地藏王菩萨那里报道了，大概再过几天就轮到自己吧。他得了某种怪病，重症肌无力，就是特别适合言情小说男主角的那种病。据说没得医，将来嗝屁的那天什么都动不了，只有眼泪可以流下来。痛！
          </p>
          <p>
            他这辈子确实没有做过什么有意义的事情，除了扶老奶奶过马路，在公车上让座位，与街坊邻居和睦相处，帮助同学考试作弊⋯⋯，范慎是一个传统意义上的无用好男人。他的父母早就去世了，所以只留下他一个人孤单地呆在医院里，等待着自己生命终结的那一天到来。动手脚，身体似乎失去了控制。范慎很困难地撑着上眼皮，看着指头算自己这辈子做过些什么有意义的事情，结果右手五根瘦成筷子一样的指头还没有数完，他就叹了一口气，很伤心地放弃了这个工作。病房里的药水味总是这么刺鼻，旁边那床的老爷子前两天已经去地藏王菩萨那里报道了，大概再过几天就轮到自己吧。他得了某种怪病，重症肌无力，就是特别适合言情小说男主角的那种病。据说没得医，将来嗝屁的那天什么都动不了，只有眼泪可以流下来。痛！
          </p>
          <p>
            他这辈子确实没有做过什么有意义的事情，除了扶老奶奶过马路，在公车上让座位，与街坊邻居和睦相处，帮助同学考试作弊⋯⋯，范慎是一个传统意义上的无用好男人。他的父母早就去世了，所以只留下他一个人孤单地呆在医院里，等待着自己生命终结的那一天到来。动手脚，身体似乎失去了控制。范慎很困难地撑着上眼皮，看着指头算自己这辈子做过些什么有意义的事情，结果右手五根瘦成筷子一样的指头还没有数完，他就叹了一口气，很伤心地放弃了这个工作。病房里的药水味总是这么刺鼻，旁边那床的老爷子前两天已经去地藏王菩萨那里报道了，大概再过几天就轮到自己吧。他得了某种怪病，重症肌无力，就是特别适合言情小说男主角的那种病。据说没得医，将来嗝屁的那天什么都动不了，只有眼泪可以流下来。痛！
          </p>
          <p>
            他这辈子确实没有做过什么有意义的事情，除了扶老奶奶过马路，在公车上让座位，与街坊邻居和睦相处，帮助同学考试作弊⋯⋯，范慎是一个传统意义上的无用好男人。他的父母早就去世了，所以只留下他一个人孤单地呆在医院里，等待着自己生命终结的那一天到来。动手脚，身体似乎失去了控制。范慎很困难地撑着上眼皮，看着指头算自己这辈子做过些什么有意义的事情，结果右手五根瘦成筷子一样的指头还没有数完，他就叹了一口气，很伤心地放弃了这个工作。病房里的药水味总是这么刺鼻，旁边那床的老爷子前两天已经去地藏王菩萨那里报道了，大概再过几天就轮到自己吧。他得了某种怪病，重症肌无力，就是特别适合言情小说男主角的那种病。据说没得医，将来嗝屁的那天什么都动不了，只有眼泪可以流下来。痛！
          </p>
          <p>
            他这辈子确实没有做过什么有意义的事情，除了扶老奶奶过马路，在公车上让座位，与街坊邻居和睦相处，帮助同学考试作弊⋯⋯，范慎是一个传统意义上的无用好男人。他的父母早就去世了，所以只留下他一个人孤单地呆在医院里，等待着自己生命终结的那一天到来。动手脚，身体似乎失去了控制。范慎很困难地撑着上眼皮，看着指头算自己这辈子做过些什么有意义的事情，结果右手五根瘦成筷子一样的指头还没有数完，他就叹了一口气，很伤心地放弃了这个工作。病房里的药水味总是这么刺鼻，旁边那床的老爷子前两天已经去地藏王菩萨那里报道了，大概再过几天就轮到自己吧。他得了某种怪病，重症肌无力，就是特别适合言情小说男主角的那种病。据说没得医，将来嗝屁的那天什么都动不了，只有眼泪可以流下来。痛！
          </p>
        </article>
      </div>
    </div>
  </div>

</template>
<script setup>
import tHeader from '@/components/tHeader.vue'
import { onMounted } from 'vue';

onMounted(() => {
  if (!CSS.supports('animation-timeline: scroll()')){
  console.log('不支持 animation-timeline')
  const bg = document.querySelector('.reel-bg')
  window.addEventListener('scroll',function(){
    bg.style.transform = `translateY(${this.scrollY / Math.PI % 184 / 368 * 100 - 80}%)`
  })
}
})
</script>
<style lang="scss" scoped>
.tyAdmin__container {
    height: 100%;
    article {
      background-color: #F5EBD4;
      padding: 1em 0.5em;
      border-left: 10px solid #405C53;
      border-right: 10px solid #405C53;
      margin: 0 15px;
    }

    p {
      margin: 0;
      padding: 0.2em 0;
      color: #2C402E;
      line-height: 150%;
      text-indent: 2em;
    }

    h1 {
      text-align: center;
      color: #F5EBD4;
    }

    .reel {
      position: sticky;
      top: 10px;
      height: 28px;
      margin: 0 15px;
      border-radius: 1px;
      border-image: url("../../../assets/view/scrollBar.png") fill 40 36/14px 12px/0 12px;
      box-shadow: 0 5px 10px 5px rgba(0, 0, 0, .3), 0 10px 20px 10px rgba(0, 0, 0, .5);
      overflow: hidden;
    }

    .reel-bg {
      position: absolute;
      left: 0;
      width: 100%;
      height: 368px;
      background: url("../../../assets/view/scrollBg.jpg") 50% 0/auto 50%;
      mix-blend-mode: multiply;
    }
    @keyframes scroll {
      0% {
        transform: translateY(-80%);
      }

      100% {
        transform: translateY(-30%);
      }
    }
    @supports (animation-timeline: scroll()) {
      .reel-bg {
        --s: 999999;
        animation: scroll 1s linear forwards calc(var(--s)/184/3.14);
        animation-timeline: scroll(root);
        animation-range: 0 calc(var(--s) * 1px);
      }
    }


    ::-webkit-scrollbar {
      display: none;
    }

}
</style>